figures/deployment-current.mmd
C4Deployment
    %% title Current OpenTogetherTube Deployment

    Deployment_Node(browser, "User's Computer", "Web Browser") {
        Person(user, "User")
        Component(frontend, "Frontend", "Vue, Typescript")
    }


    Deployment_Node(ott, "OpenTogetherTube", "Docker") {
        Container(monolith, "Monolith", "Typescript, Javascipt")
        SystemDb(postgres, "Postgres", "Persists Users, Rooms")
        SystemDb(redis, "Redis", "Caching, Session Store")
    }

    Rel(user, frontend, "Uses")
    Rel(frontend, monolith, "Uses", "REST API, websockets")
    Rel(monolith, postgres, "Read/Write")
    Rel(monolith, redis, "Read/Write")

    UpdateLayoutConfig($c4ShapeInRow="2", $c4BoundaryInRow="1")
